module Nikolay //это не надо отправлять в интерпретатор

open System

//тебе нужно написать эту функцию
//подумай, какой тип должен быть у этой функции?
//let filter f list =
    //твой код должен быть здесь
    //код, принадлежащий функции, обозначается отступом
    //функция возвращает то, что стоит в последней строчке её кода

    //в своём коде ты можешь использовать только:
    //List.fold, List.rev, (::), if

//например, такое её применение должно вернуть список только с чётными числами:
//filter (fun x -> x % 2 = 0) [1..20]